{
	"nav": {
		"home": "Главная",
		"workExperience": "Работа",
		"myProjects": "Проекты",
		"contactMe": "Контакты"
	},
	"pages": {
		"home": {
			"name": "Билял Абдулганиев",
			"specialization": "Full-Stack Web разработчик",
			"about": "Я занимаюсь веб-разработкой с 2018 года. Обладаю опытом работы над различными проектами — от стартапов до собственных экспериментальных решений. Самоорганизован и ориентирован на результат, предпочитаю чистый код, продуманный UX и современные технологии. Стараюсь постоянно углублять знания и применять их на практике.\nТехнологии и инструменты, с которыми работал:"
		},
		"workExperience": {
			"title": "Опыт работы"
		},
		"myProjects": {
			"title": "Мои проекты",
			"description": "Я участвовал в разработке нескольких стартап-проектов, большинство из которых не были опубликованы публично. Ниже — ключевые задачи и технологические решения, над которыми я работал. Некоторые демо-реализации этих задач представлены в моем профиле на GitHub.",
			"tasks": [
				"Написание хранимых процедур PostgreSQL для оптимизации обработки данных",
				"JSON-конфигурируемый опросник с настройкой внешнего вида (разделы, вопросы) и логикой обработки ответов",
				"Динамически настраиваемая форма с валидацией полей и дополнительной логикой",
				"Создание пользовательского WYSIWYG-редактора",
				"Визуализация генеалогического дерева, построение графиков",
				"Мультиязычная локализация приложений",
				"Создание пользовательского аудио- и видеоплеера, а также интерактивных квизов"
			],
			"ownProjects": "В свободное время развиваю собственные проекты, что позволяет мне экспериментировать с новыми технологиями и углублять профессиональные навыки."
		},
		"contactMe": {
			"title": "Связаться со мной",
			"description": "Буду рад пообщаться — по вопросам сотрудничества, консультаций или просто обмена идеями. Ниже вы найдёте ссылки для связи."
		}
	},
	"techStack": {
		"languages": "Языки и разметка",
		"frontend": "Фреймворки и библиотеки (Frontend)",
		"state": "Управление состоянием",
		"backend": "Backend и базы данных",
		"testing": "Тестирование и качество",
		"infrastructure": "Инфраструктура и инструменты",
		"other": "Прочее"
	},
	"jobs": {
		"thr": {
			"period": "2020-н.в.",
			"description": "Команда разработчиков полного цикла, реализующая проекты в логистике, финтехе, IoT и blockchain.",
			"contribution": "Работа в компании дала мне ценный опыт участия в технически разнообразных и интересных проектах. Я сотрудничал с опытными и отзывчивыми коллегами, а руководство обеспечивало позитивную и мотивирующую рабочую атмосферу.\nРазвил и продолжаю развивать навыки:",
			"tasks": [
				"Использование Canvas API и графических библиотек",
				"Разработка модулей с JSON-конфигурацией (опросников и динамических форм с валидацией)",
				"Оптимизация рендеринга и взаимодействия со сложными формами с большим количеством полей",
				"Адаптация веб-приложений под мобильные устройства",
				"Разработка на TypeScript",
				"Создание пользовательских видео- и аудиоплееров"
			]
		},
		"oav": {
			"period": "2023",
			"description": "Централизованный инструмент управления аукционами для дилеров новых и подержанных автомобилей, который упрощает поиск и оценку автомобилей на всех крупных аукционах.",
			"contribution": "Я поддерживал клиентскую часть и участвовал в разработке новых функций. Перевел код приложения с JavaScript на TypeScript для улучшения типизации и поддержки.\nРабота над этим проектом помогла мне улучшить навыки коммуникации и получить опыт работы с крупномасштабной архитектурой."
		},
		"flu": {
			"period": "2022-2023",
			"description": "Крупнейшая онлайн-школа языков в Латинской Америке, ориентированная на разговорную практику и доступность образования.",
			"contribution": "Разрабатывалась платформа с многоуровневой структурой продаж и реферальной системой.\nЯ участвовал в реализации интерфейсных компонентов, интеграции с платежными системами PIX и Stripe, а также реализовал мультиязычную локализацию.\nЭтот проект дал мне ценный опыт работы с бразильским рынком и платёжной инфраструктурой."
		},
		"fgen": {
			"period": "2020-2022",
			"description": "Технологическая компания в сфере здравоохранения, развивающая генетическое консультирование и повышающая стандарты профилактики, оценки наследственных рисков и общественного здравоохранения.",
			"contribution": "Я участвовал в разработке ключевого функционала платформы:",
			"tasks": [
				"реализация страниц и компонентов пользовательского интерфейса",
				"построение генеалогических древ с помощью графических библиотек",
				"создавал JSON-конфигурируемые анкеты",
				"разработал редактор отчётов с WYSIWYG-интерфейсом"
			]
		},
		"raa": {
			"period": "2018",
			"description": "Right&Above предлагает эффективные IT-решения, которые помогают компаниям проводить цифровую трансформацию всех аспектов своего бизнеса, оптимизировать процессы и ускорять разработку новых продуктов и услуг.",
			"contribution": "Разрабатывалось веб-приложение для управления компаниями и сотрудниками с системой ролевого доступа.\nЯ участвовал в разработке бэкенда, интеграции с базой данных и писал хранимые процедуры для оптимизации обработки данных."
		}
	},
	"contact": {
		"email": "Написать email"
	}
}